; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared2 - mode
	infrared6 - mode
	thermograph0 - mode
	spectrograph1 - mode
	thermograph5 - mode
	spectrograph3 - mode
	spectrograph4 - mode
	Star1 - direction
	Star2 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
	GroundStation9 - direction
	GroundStation10 - direction
	GroundStation0 - direction
	Planet11 - direction
	Star12 - direction
	Planet13 - direction
	Star14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 infrared6)
	(supports instrument0 spectrograph4)
	(supports instrument0 thermograph5)
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph0)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
)
(:goal (and
	(pointing satellite0 GroundStation10)
	(have_image Planet11 thermograph0)
	(have_image Star12 spectrograph3)
	(have_image Planet13 spectrograph4)
	(have_image Star14 infrared6)
	(have_image Star14 spectrograph3)
	(have_image Phenomenon15 spectrograph3)
	(have_image Phenomenon15 thermograph5)
))

)

; plan
1. (turn_to satellite0 groundstation0 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 8
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
3. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 8
4. (turn_to satellite0 planet13 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet13)
   goals met: 0 of 8
5. (take_image satellite0 planet13 instrument0 spectrograph4)
   added: (have_image planet13 spectrograph4)
   goals met: 1 of 8
6. (turn_to satellite0 planet11 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet11)
   goals met: 1 of 8
7. (take_image satellite0 planet11 instrument0 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 2 of 8
8. (turn_to satellite0 phenomenon15 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon15)
   goals met: 2 of 8
9. (take_image satellite0 phenomenon15 instrument0 thermograph5)
   added: (have_image phenomenon15 thermograph5)
   goals met: 3 of 8
10. (take_image satellite0 phenomenon15 instrument0 spectrograph3)
   added: (have_image phenomenon15 spectrograph3)
   goals met: 4 of 8
11. (turn_to satellite0 star12 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 star12)
   goals met: 4 of 8
12. (take_image satellite0 star12 instrument0 spectrograph3)
   added: (have_image star12 spectrograph3)
   goals met: 5 of 8
13. (turn_to satellite0 star14 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star14)
   goals met: 5 of 8
14. (take_image satellite0 star14 instrument0 infrared6)
   added: (have_image star14 infrared6)
   goals met: 6 of 8
15. (take_image satellite0 star14 instrument0 spectrograph3)
   added: (have_image star14 spectrograph3)
   goals met: 7 of 8
16. (turn_to satellite0 groundstation10 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 groundstation10)
   goals met: 8 of 8
